<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs Jan.AI for Intel Macs</string>
    <key>Identifier</key>
    <string>com.github.BIXALBaileyWalters.install.JanAI-Universal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
		<string>JanAI</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.BIXALbaileywalters.extraprocessors/GetUserHome</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>menloresearch/jan</string>
                <key>asset_regex</key>
                <string>Jan_.*_universal\.dmg</string>
                <key>latest_only</key>
                <bool>True</bool>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Jan.app</string>
                    <key>destination_path</key>
                    <string>%user_home%/Applications</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                    <key>mode</key>
                    <string>0755</string>
                  </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
