<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest verison of Logitech Options (Bluetooth and USB)</string>
	<key>Identifier</key>
    <string>com.github.BixalCodySauber.install.LogiOptions</string>
	<key>Input</key>
	<dict>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.BixalCodySauber.download.LogiOptions</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>LogiMgr*.app</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%found_filename%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/LogiInstaller</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/LogiInstaller.app/Contents/Resources/LogiMgr.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>