<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Options (Bluetooth and USB)</string>
    <key>Identifier</key>
    <string>com.github.BixalCodySauber.download.LogiOptions</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogiMgr</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>LogiMgr.zip</string>
                    <key>url</key>
                    <string>https://download01.logi.com/web/ftp/pub/techsupport/options/options_installer.zip</string>
                    <key>download_dir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloaderPython</string>
            </dict>
        </array>
</dict>
</plist>