<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest verison of Logitech Options (Bluetooth and USB)
	<key>Identifier</key>
    <string>com.github.BixalCodySauber.install.LogiOptions</string>
	<key>Input</key>
	<dict>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.BixalCodySauber.download.LogiOptions</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>/Users/Shared/autopkg/cache/com.github.BixalCodySauber.download.LogiOptions/downloads/LogiMgr/*.app/LogiMgr.pkg </string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>