<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Options (Bluetooth and USB)</string>
    <key>Identifier</key>
    <string>com.github.BixalCodySauber.download.LogiOptions</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogiMgr</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.zip</string>
                    <key>url</key>
                    <string>https://download01.logi.com/web/ftp/pub/techsupport/options/options_installer.zip</string>
                    <key>download_dir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>purge_destination</key>
                    <true/>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/LogiMgr/LogiMgr Installer*</string>
                </dict>
                <key>Processor</key>
                <string>FileFinder</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%found_filename%</string>
                    <key>requirement</key>
                    <string>identifier "com.logitech.manager.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                    <key>source</key>
                    <string>%found_filename%</string>
                    <key>target</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/LogiInstaller.app</string>
                </dict>
            </dict>
        </array>
</dict>
</plist>