<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest RStudio installer package.</string>
    <key>Identifier</key>
    <string>com.github.BIXALBaileyWalters.download.vonage</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Vonage</string>
        <key>DOWNLOAD_MIRROR</key>
        <string>https://vbc-downloads.vonage.com/mac/VonageBusinessSetup.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_MIRROR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Vonage Business.app</string>
                <key>requirement</key>
                <string>identifier "com.vonage.vbc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = E37FZSUGQP</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
