<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Bitwarden, creates a package, and installs it.
	Modified from: https://github.com/autopkg/drewdiver-recipes

	</string>
	<key>Identifier</key>
	<string>com.github.BIXALbaileywalters.install.Figma</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>Figma</string>
        <key>VENDOR</key>
        <string>Figma</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.pkg.Figma</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
