<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Zotero. This recipe takes is adjusted to accept .app files that include versioning if Zotero ever changes their naming schema. This recipe packages and installs Zotero.
</string>
    <key>Identifier</key>
	 <string>com.github.BixalCodySauber.install.zotero</string>
	<key>Input</key>
	<dict>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.BixalCodySauber.pkg.zotero</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
