<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the current release version of Slack. Modified from https://github.com/autopkg/killahquam-recipes/tree/master/Slack</string>
    <key>Identifier</key>
    <string>com.github.BIXALbaileywalters.install.zoom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>zoom.us</string>
        <key>VENDOR</key>
        <string>Zoom</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.zoomus</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>/Users/Shared/autopkg/cache/com.github.BIXALbaileywalters.install.zoom/downloads/zoom.us.pkg</string>
            </dict>           
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>