<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AWS VPN Client. Set ARCH to either arm64 or x86_64.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.AWSVPNClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AWS VPN Client</string>
        <key>ARCH</key>
        <string>arm64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FindAndReplace</string>
            <key>Arguments</key>
            <dict>
                <key>input_string</key>
                <string>%ARCH%</string>
                <key>find</key>
                <string>arm64</string>
                <key>replace</key>
                <string>_ARM64</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FindAndReplace</string>
            <key>Arguments</key>
            <dict>
                <key>input_string</key>
                <string>%output_string%</string>
                <key>find</key>
                <string>x86_64</string>
                <key>replace</key>
                <string></string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_ARCH</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://docs.aws.amazon.com/vpn/latest/clientvpn-user/client-vpn-connect-macos-release-notes.html</string>
                <key>re_pattern</key>
                <string>https://.*?\.cloudfront\.net/OSX%DOWNLOAD_ARCH%/.*?/AWS_VPN_Client%DOWNLOAD_ARCH%\.pkg</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%ARCH%.pkg</string>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: AMZN Mobile LLC (94KV3E626L)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
