<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Options (Bluetooth and USB)</string>
    <key>Identifier</key>
    <string>com.github.Bixalbaileywalters.download.rstudio</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>LogiMgr</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>R-release.pkg</string>
                    <key>url</key>
                    <string>https://cran.rstudio.com/bin/macosx/big-sur-arm64/base/R-release.pkg</string>
                    <key>download_dir</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloaderPython</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/R-release*</string>
                </dict>
                <key>Processor</key>
                <string>FileFinder</string>
            </dict>
            <dict>
			    <key>Arguments</key>
			    <dict>
				    <key>expected_authority_names</key>
				    <array>
					    <string>Developer ID Certification Authority</string>
					    <string>Apple Root CA</string>
				    </array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
</dict>
</plist>