<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest verison of Logitech Options (Bluetooth and USB)</string>
	<key>Identifier</key>
    <string>com.github.BIXALbaileywalters.install.JamfConnect</string>
	<key>Input</key>
	<dict>
		<key>RELEASE</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.BIXALbaileywalters.download.JamfConnect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/JamfConnect.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/JamfConnectLaunchAgent.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>